tests/jmeter/alertas_carga_frames.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Comuvigia - Pruebas de Carga">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">5</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <longProp name="ThreadGroup.duration">300</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager">
          <collectionProp name="CookieManager.cookies"/>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/alertas/nueva-alerta</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;id_camara&quot;: 1,&#xd;
  &quot;mensaje&quot;: &quot;Evento prueba frames&quot;,&#xd;
  &quot;hora_suceso&quot;: &quot;2026-03-20T12:00:00Z&quot;,&#xd;
  &quot;tipo&quot;: 99,&#xd;
  &quot;score_confianza&quot;: 0.92,&#xd;
  &quot;descripcion_suceso&quot;: &quot;Evento IA simulado&quot;,&#xd;
  &quot;estado&quot;: 0,&#xd;
  &quot;fps&quot;: 5,&#xd;
  &quot;frames&quot;: [&#xd;
    &quot;frame1&quot;,&quot;frame2&quot;,&quot;frame3&quot;,&quot;frame4&quot;,&quot;frame5&quot;,&quot;frame6&quot;,&quot;frame7&quot;,&quot;frame8&quot;,&quot;frame9&quot;,&quot;frame10&quot;, &quot;frame11&quot;, &quot;frame12&quot;, &quot;frame13&quot;, &quot;frame14&quot;, &quot;frame15&quot;, &quot;frame16&quot;, &quot;frame17&quot;, &quot;frame18&quot;, &quot;frame19&quot;, &quot;frame20&quot;, &quot;frame21&quot;, &quot;frame22&quot;, &quot;frame23&quot;, &quot;frame24&quot;, &quot;frame25&quot;,&quot;frame26&quot;,&quot;frame27&quot;,&quot;frame28&quot;,&quot;frame29&quot;,&quot;frame30&quot;,&quot;frame31&quot;,&quot;frame32&quot;,&quot;frame33&quot;,&quot;frame34&quot;,&quot;frame35&quot;, &quot;frame36&quot;, &quot;frame37&quot;, &quot;frame38&quot;, &quot;frame39&quot;, &quot;frame40&quot;, &quot;frame41&quot;, &quot;frame42&quot;, &quot;frame43&quot;, &quot;frame44&quot;, &quot;frame45&quot;, &quot;frame46&quot;, &quot;frame47&quot;, &quot;frame48&quot;, &quot;frame49&quot;, &quot;frame50&quot;&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>