tests/jmeter/frames-ia.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="ComuVigIA - Frames IA">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Procesamiento Frames - IA Simulada">
        <intProp name="ThreadGroup.num_threads">5</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <longProp name="ThreadGroup.duration">180</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">3000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="01 - POST Nueva Alerta con Frames">
          <stringProp name="HTTPSampler.path">/api/alertas/nueva-alerta</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;id_camara&quot;: 1,&#xd;
  &quot;mensaje&quot;: &quot;Evento IA simulado&quot;,&#xd;
  &quot;hora_suceso&quot;: &quot;2025-04-21T12:00:00Z&quot;,&#xd;
  &quot;tipo&quot;: 99,&#xd;
  &quot;score_confianza&quot;: 0.92,&#xd;
  &quot;descripcion_suceso&quot;: &quot;Persona sospechosa detectada&quot;,&#xd;
  &quot;estado&quot;: 0,&#xd;
  &quot;fps&quot;: 5,&#xd;
  &quot;frames&quot;: [&#xd;
    &quot;frame1&quot;,&quot;frame2&quot;,&quot;frame3&quot;,&quot;frame4&quot;,&quot;frame5&quot;,&#xd;
    &quot;frame6&quot;,&quot;frame7&quot;,&quot;frame8&quot;,&quot;frame9&quot;,&quot;frame10&quot;,&#xd;
    &quot;frame11&quot;,&quot;frame12&quot;,&quot;frame13&quot;,&quot;frame14&quot;,&quot;frame15&quot;,&#xd;
    &quot;frame16&quot;,&quot;frame17&quot;,&quot;frame18&quot;,&quot;frame19&quot;,&quot;frame20&quot;,&#xd;
    &quot;frame21&quot;,&quot;frame22&quot;,&quot;frame23&quot;,&quot;frame24&quot;,&quot;frame25&quot;,&#xd;
    &quot;frame26&quot;,&quot;frame27&quot;,&quot;frame28&quot;,&quot;frame29&quot;,&quot;frame30&quot;&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">C:\Users\fbrauerc\Documents\jmeter\resultados\frames-ia.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>